CREATE DATABASE  IF NOT EXISTS `dbwebshop` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `dbwebshop`;
-- MySQL dump 10.13  Distrib 8.0.45, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: dbwebshop
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Category`
--

DROP TABLE IF EXISTS `Category`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Category` (
  `CategoryID` int NOT NULL AUTO_INCREMENT,
  `CategoryName` varchar(45) NOT NULL,
  PRIMARY KEY (`CategoryID`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Category`
--

LOCK TABLES `Category` WRITE;
/*!40000 ALTER TABLE `Category` DISABLE KEYS */;
INSERT INTO `Category` VALUES (1,'Сайт-визитка'),(2,'Интернет-магазин'),(3,'Корпоративный сайт'),(4,'Лендинг (Landing Page)'),(5,'Портфолио'),(6,'Блог'),(7,'Информационный портал'),(8,'Новостной сайт'),(9,'Форум'),(10,'Персональный сайт'),(11,'Промо-сайт'),(12,'Образовательный портал');
/*!40000 ALTER TABLE `Category` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Clients`
--

DROP TABLE IF EXISTS `Clients`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Clients` (
  `ClientID` int NOT NULL AUTO_INCREMENT,
  `Surname` varchar(90) NOT NULL,
  `FirstName` varchar(75) NOT NULL,
  `MiddleName` varchar(90) DEFAULT NULL,
  `Email` varchar(100) NOT NULL,
  `PhoneNumber` varchar(20) NOT NULL,
  PRIMARY KEY (`ClientID`)
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Clients`
--

LOCK TABLES `Clients` WRITE;
/*!40000 ALTER TABLE `Clients` DISABLE KEYS */;
INSERT INTO `Clients` VALUES (1,'Попов','Михаил','Владимирович','mihail.popov@bk.ru','+7 (915) 234-56-01'),(2,'Лебедев','Илья','Андреевич','ilya.lebedev@yandex.ru','+7 (916) 845-12-13'),(3,'Белов','Роман','Сергеевич','roman.belov@gmail.com','+7 (903) 678-90-23'),(4,'Тимофеев','Артём','Павлович','artem.timofeev@mail.ru','+7 (912) 445-77-34'),(5,'Павлов','Виктор','Николаевич','viktor.pavlov@yandex.ru','+7 (917) 332-11-45'),(6,'Рыбаков','Константин','Игоревич','kosta.rybakov@gmail.com','+7 (909) 556-88-56'),(7,'Нестеров','Сергей','Петрович','sergey.nesterov@mail.ru','+7 (925) 101-23-67'),(8,'Фадеев','Алексей','Михайлович','aleksey.fadeev@yandex.ru','+7 (926) 214-09-78'),(9,'Громов','Денис','Викторович','denis.gromov@gmail.com','+7 (913) 777-44-19'),(10,'Кудрин','Евгений','Анатольевич','evgeny.kudrin@mail.ru','+7 (960) 998-21-20'),(11,'Снегов','Никита','Олегович','nikita.snegov@yandex.ru','+7 (985) 430-12-31'),(12,'Ларин','Павел','Дмитриевич','pavel.larin@gmail.com','+7 (962) 555-33-42'),(13,'Прокофьев','Георгий','Ильич','georgy.prokofiev@mail.ru','+7 (967) 241-54-53'),(14,'Савин','Игорь','Алексеевич','igor.savin@yandex.ru','+7 (903) 812-65-64'),(15,'Денисов','Максим','Романович','maxim.denisov@gmail.com','+7 (915) 329-76-75'),(16,'Пономарёв','Вадим','Сергеевич','vadim.ponomarev@yahoo.com','+7 (916) 218-87-86'),(17,'Акимов','Рустам','Павлович','rustam.akimov@yandex.ru','+7 (903) 640-98-97'),(18,'Веденин','Вячеслав','Иванович','vyacheslav.vedenin@gmail.com','+7 (925) 471-09-08'),(19,'Баранов','Фёдор','Никитич','fedor.baranov@mail.ru','+7 (909) 382-10-19'),(21,'Степанов','Роман','Андреевич','roman.stepanov@gmail.com','+7 (912) 668-32-31'),(22,'Архипов','Дмитрий','Владимирович','dmitriy.arkhipov@mail.ru','+7 (960) 774-43-42'),(23,'Марченко','Тимур','Олегович','timur.marchenko@yandex.ru','+7 (985) 891-54-53'),(24,'Зимин','Матвей','Александрович','matvey.zimin@gmail.com','+7 (926) 210-65-64'),(25,'Лосев','Валерий','Геннадьевич','valeriy.losev@mail.ru','+7 (903) 123-76-75'),(26,'Махов','Арсений','Михайлович','arsen.makhov@yandex.ru','+7 (915) 987-87-86'),(27,'Князев','Иван','Кириллович','ivan.knyazev@gmail.com','+7 (917) 654-98-97'),(29,'Черемисов','Анатолий','Сергеевич','anatoly.cheremisov@yandex.ru','+7 (960) 357-10-19'),(30,'Смоляков','Назар','Игоревич','nazar.smolyakov@gmail.com','+7 (962) 468-21-20'),(31,'Ульянов','Борис','Павлович','boris.ulyanov@mail.ru','+7 (985) 579-32-31'),(32,'Беляков','Олег','Николаевич','oleg.belyakov@yandex.ru','+7 (926) 680-43-42'),(33,'Юдин','Савелий','Викторович','saveliy.yudin@gmail.com','+7 (915) 791-54-53'),(34,'Хлопов','Родион','Григорьевич','rodion.khlopov@mail.ru','+7 (903) 802-65-64'),(35,'Поплавский','Юрий','Алексеевич','yuriy.poplavsky@yandex.ru','+7 (917) 213-76-75'),(36,'Кириллов','Николай','Дмитриевич','nikolay.kirillov@gmail.com','+7 (909) 124-87-86'),(37,'Бородин','Владислав','Петрович','vladislav.borodin@mail.ru','+7 (921) 335-98-97'),(38,'Суханов','Александр','Романович','alex.sukhanov@yandex.ru','+7 (960) 446-09-08'),(40,'Дьячков','Леонид','Сергеевич','leonid.dyachkov@mail.ru','+7 (915) 668-21-20'),(41,'Золотарёв','Раймонд','Андреевич','raymond.zolotarev@gmail.com','+7 (926) 779-32-31'),(42,'Коваленко','Платон','Никитич','platon.kovalenko@yandex.ru','+7 (903) 880-43-42'),(43,'Макеев','Григорий','Александрович','grigory.makeev@mail.ru','+7 (917) 991-54-53'),(44,'Назаров','Роман','Вадимович','roman.nazarov@gmail.com','+7 (960) 102-65-64'),(45,'Рожков','Семен','Павлович','semen.rozhkov@yandex.ru','+7 (962) 213-76-75'),(47,'Калинин','Артур','Олегович','artur.kalinin@gmail.com','+7 (915) 435-98-97'),(48,'Фоминский','Виталий','Денисович','vitaly.fominsky@mail.ru','+7 (903) 546-09-08'),(101,'Степанов','Иван','Андреевич','client1_t0kc@test.loc','+7 (999) 867-81-94'),(102,'Волков','Евгений','Евгеньевич','client2_cztb@test.loc','+7 (999) 131-46-55'),(103,'Кузнецов','Дмитрий','Анатольевич','client3_76q7@test.loc','+7 (999) 506-35-95'),(104,'Морозов','Денис','Максимович','client4_xhud@test.loc','+7 (999) 287-70-22'),(105,'Иванов','Михаил','Олегович','client5_4mhv@test.loc','+7 (999) 878-46-87'),(106,'Кузнецов','Иван','Юрьевич','client6_aht1@test.loc','+7 (999) 490-54-88'),(107,'Павлов','Антон','Михайлович','client7_zza5@test.loc','+7 (999) 210-30-45'),(108,'Васильев','Даниил','Михайлович','client8_21ya@test.loc','+7 (999) 209-29-39'),(109,'Павлов','Сергей','Евгеньевич','client9_xja5@test.loc','+7 (999) 186-85-81'),(110,'Соколов','Даниил','Максимович','client10_b86i@test.loc','+7 (999) 453-18-16'),(111,'Иванов','Егор','Петрович','client11_k7t0@test.loc','+7 (999) 483-64-87'),(112,'Алексеев','Максим','Николаевич','client12_r6y9@test.loc','+7 (999) 729-41-69'),(113,'Соколов','Владислав','Николаевич','client13_39po@test.loc','+7 (999) 145-84-59'),(114,'Фёдоров','Егор','Максимович','client14_62vh@test.loc','+7 (999) 345-29-12'),(115,'Смирнов','Никита','Олегович','client15_aojq@test.loc','+7 (999) 382-19-89'),(116,'Степанов','Павел','Максимович','client16_k31a@test.loc','+7 (999) 757-30-71'),(117,'Лебедев','Роман','Иванович','client17_g4jj@test.loc','+7 (999) 460-66-53'),(118,'Кузнецов','Павел','Андреевич','client18_oaht@test.loc','+7 (999) 749-71-24'),(119,'Соколов','Роман','Евгеньевич','client19_541g@test.loc','+7 (999) 216-11-35'),(120,'Кузнецов','Илья','Алексеевич','client20_ci9e@test.loc','+7 (999) 995-46-53'),(121,'Степанов','Иван','Иванович','client21_g3ft@test.loc','+7 (999) 850-22-16'),(122,'Фёдоров','Антон','Максимович','client22_7jpi@test.loc','+7 (999) 941-19-45'),(123,'Волков','Максим','Олегович','client23_gqk7@test.loc','+7 (999) 501-50-35'),(124,'Фёдоров','Евгений','Владимирович','client24_3cnz@test.loc','+7 (999) 246-76-52'),(125,'Новиков','Роман','Евгеньевич','client25_z762@test.loc','+7 (999) 494-21-33'),(126,'Петров','Илья','Владимирович','client26_nepl@test.loc','+7 (999) 947-51-62'),(127,'Михайлов','Павел','Сергеевич','client27_hz9i@test.loc','+7 (999) 765-51-89'),(128,'Степанов','Павел','Максимович','client28_y0to@test.loc','+7 (999) 324-99-82'),(129,'Иванов','Дмитрий','Олегович','client29_cfba@test.loc','+7 (999) 919-89-80'),(130,'Морозов','Егор','Михайлович','client30_737g@test.loc','+7 (999) 811-67-41'),(131,'Алексеев','Павел','Максимович','client31_9ept@test.loc','+7 (999) 715-48-57'),(132,'Фёдоров','Константин','Владимирович','client32_ckbp@test.loc','+7 (999) 850-25-97'),(133,'Васильев','Даниил','Петрович','client33_s2d6@test.loc','+7 (999) 151-48-33'),(134,'Лебедев','Антон','Алексеевич','client34_cz2a@test.loc','+7 (999) 763-87-89'),(135,'Лебедев','Алексей','Максимович','client35_bm98@test.loc','+7 (999) 914-35-68'),(136,'Соколов','Антон','Александрович','client36_4goy@test.loc','+7 (999) 370-89-42'),(137,'Новиков','Илья','Иванович','client37_y0bi@test.loc','+7 (999) 520-72-39'),(138,'Павлов','Константин','Дмитриевич','client38_jee8@test.loc','+7 (999) 165-13-15'),(139,'Фёдоров','Артём','Николаевич','client39_56r4@test.loc','+7 (999) 791-25-41'),(140,'Кузнецов','Дмитрий','Анатольевич','client40_4bzd@test.loc','+7 (999) 894-18-69'),(141,'Лебедев','Михаил','Михайлович','client41_bou1@test.loc','+7 (999) 986-30-71'),(142,'Попов','Дмитрий','Юрьевич','client42_m5oz@test.loc','+7 (999) 729-73-48'),(143,'Фёдоров','Илья','Владимирович','client43_d59g@test.loc','+7 (999) 288-27-88'),(144,'Петров','Иван','Иванович','client44_3ovy@test.loc','+7 (999) 263-52-66'),(145,'Михайлов','Евгений','Алексеевич','client45_p9y5@test.loc','+7 (999) 298-42-29'),(146,'Козлов','Роман','Евгеньевич','client46_8jw1@test.loc','+7 (999) 507-81-26'),(147,'Соколов','Иван','Юрьевич','client47_mfuq@test.loc','+7 (999) 193-21-97'),(148,'Попов','Сергей','Александрович','client48_3w0b@test.loc','+7 (999) 104-23-71'),(149,'Васильев','Павел','Юрьевич','client49_c91k@test.loc','+7 (999) 647-77-92'),(150,'Степанов','Антон','Олегович','client50_3818@test.loc','+7 (999) 845-96-52'),(151,'Михайлов','Павел','Дмитриевич','client51_n7pq@test.loc','+7 (999) 978-93-54'),(152,'Соколов','Антон','Сергеевич','client52_toby@test.loc','+7 (999) 486-90-13'),(153,'Морозов','Даниил','Юрьевич','client53_8hcz@test.loc','+7 (999) 156-59-20'),(154,'Егоров','Сергей','Юрьевич','client54_afrj@test.loc','+7 (999) 283-45-41'),(155,'Семёнов','Павел','Николаевич','client55_xftz@test.loc','+7 (999) 214-39-98'),(156,'Васильев','Даниил','Владимирович','client56_lvy3@test.loc','+7 (999) 212-49-91'),(157,'Смирнов','Никита','Михайлович','client57_66eq@test.loc','+7 (999) 864-62-19'),(158,'Волков','Илья','Дмитриевич','client58_1uly@test.loc','+7 (999) 547-56-75'),(159,'Волков','Владислав','Юрьевич','client59_9guq@test.loc','+7 (999) 552-63-46'),(160,'Степанов','Артём','Юрьевич','client60_wre2@test.loc','+7 (999) 402-45-11');
/*!40000 ALTER TABLE `Clients` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Order`
--

DROP TABLE IF EXISTS `Order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Order` (
  `OrderID` int NOT NULL AUTO_INCREMENT,
  `UserID` int NOT NULL,
  `ClientID` int NOT NULL,
  `OrderDate` date NOT NULL,
  `OrderCompDate` date NOT NULL,
  `StatusID` int NOT NULL,
  `OrderCost` decimal(12,2) NOT NULL,
  `Discount` decimal(12,2) DEFAULT '0.00',
  `Surcharge` decimal(12,2) DEFAULT '0.00',
  PRIMARY KEY (`OrderID`),
  KEY `fk_order_user_idx` (`UserID`),
  KEY `fk_order_client_idx` (`ClientID`),
  KEY `fk_order_status_idx` (`StatusID`),
  CONSTRAINT `fk_order_client` FOREIGN KEY (`ClientID`) REFERENCES `Clients` (`ClientID`),
  CONSTRAINT `fk_order_status` FOREIGN KEY (`StatusID`) REFERENCES `Status` (`StatusID`),
  CONSTRAINT `fk_order_user` FOREIGN KEY (`UserID`) REFERENCES `Users` (`UserID`)
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Order`
--

LOCK TABLES `Order` WRITE;
/*!40000 ALTER TABLE `Order` DISABLE KEYS */;
INSERT INTO `Order` VALUES (1,2,17,'2025-12-09','2025-12-24',2,78500.30,0.00,0.00),(2,2,19,'2025-12-09','2025-12-13',1,15583.64,0.00,2032.65),(3,2,10,'2025-12-09','2025-12-14',4,123120.12,7980.01,17100.02),(4,2,3,'2025-12-09','2025-12-16',3,24550.00,0.00,0.00),(5,2,19,'2025-12-09','2026-01-14',1,44000.66,0.00,0.00),(6,2,10,'2025-12-09','2026-07-28',2,113925.89,8575.07,0.00),(101,102,110,'2025-08-29','2025-09-29',3,444975.39,21682.67,10229.43),(102,132,138,'2025-07-27','2025-09-13',1,200078.56,11128.36,6819.32),(103,111,122,'2025-10-17','2025-11-28',2,249675.62,18383.13,723.20),(104,153,105,'2025-09-15','2025-11-09',1,152030.31,15048.98,6027.34),(105,114,151,'2025-02-04','2025-02-21',4,27534.74,976.09,218.78),(106,140,141,'2025-11-09','2025-12-06',2,217337.71,4085.38,5773.51),(107,114,106,'2025-04-13','2025-06-06',4,428939.01,39094.43,15508.79),(108,112,121,'2025-04-30','2025-05-05',2,103398.06,4153.67,2772.11),(109,136,120,'2025-04-04','2025-04-17',3,440669.82,25352.27,774.42),(110,153,113,'2025-08-24','2025-09-12',1,279560.61,21456.81,10971.72),(111,150,134,'2025-11-06','2026-01-04',2,67772.90,6758.39,1530.95),(112,130,105,'2025-05-12','2025-06-10',1,383155.49,12720.07,8288.75),(113,160,128,'2025-03-12','2025-03-23',1,337249.49,23304.30,9050.55),(114,113,103,'2025-11-21','2025-12-24',4,188684.80,5448.77,8564.13),(115,125,134,'2025-02-21','2025-03-11',1,186283.92,17561.60,9304.99),(116,118,107,'2025-02-27','2025-04-16',4,357769.05,17528.19,3884.93),(117,128,102,'2025-10-15','2025-12-13',3,311638.18,23977.72,13406.12),(118,159,135,'2025-11-06','2026-01-04',4,371951.40,1800.03,15862.40),(119,144,131,'2025-07-14','2025-07-21',4,12741.88,631.08,346.12),(120,131,126,'2025-08-16','2025-10-05',2,343527.98,32458.51,99.00),(121,122,124,'2025-12-15','2026-01-28',3,440468.87,32023.99,8980.10),(122,158,121,'2025-08-28','2025-10-05',1,195196.52,13272.02,4681.29),(123,114,118,'2025-08-04','2025-08-15',4,400566.22,11799.49,14954.80),(124,143,155,'2025-09-02','2025-09-27',1,449743.33,11846.35,6278.63),(125,150,134,'2025-10-12','2025-10-31',2,50423.72,4124.81,1583.67),(126,149,105,'2025-10-23','2025-11-16',4,232632.34,1261.32,7505.63),(127,116,128,'2025-12-05','2026-01-11',3,60101.10,5485.69,2248.72),(128,140,123,'2025-03-26','2025-04-05',2,439077.76,37767.55,141.72),(129,113,142,'2025-04-21','2025-04-29',1,124962.64,2468.91,3079.72),(130,122,136,'2025-09-11','2025-10-02',1,435254.52,13889.10,11324.43),(131,129,131,'2025-02-05','2025-03-15',1,442238.67,25844.02,4283.71),(132,107,151,'2025-08-25','2025-10-03',4,161958.13,12424.00,4630.97),(133,113,126,'2025-03-25','2025-05-12',1,246158.78,18037.20,4473.56),(134,132,102,'2025-08-27','2025-10-04',2,259321.45,24134.47,9762.31),(135,156,153,'2025-02-25','2025-04-07',2,285955.66,7826.00,279.41),(136,148,105,'2025-03-28','2025-05-15',4,51408.66,1393.92,195.53),(137,135,139,'2025-11-19','2026-01-18',4,44321.14,2931.71,114.29),(138,120,104,'2025-12-07','2026-01-31',1,490290.90,32079.04,21195.85),(139,121,108,'2025-07-09','2025-08-13',1,313500.73,17038.49,10290.36),(140,154,160,'2025-09-22','2025-10-30',1,238395.52,15359.78,5316.66),(141,125,123,'2025-08-24','2025-10-07',4,255211.61,12962.13,2927.50),(142,148,156,'2025-08-22','2025-09-22',4,83501.73,4618.78,769.34),(143,159,143,'2025-01-01','2025-01-06',2,137467.21,6949.45,139.52),(144,127,112,'2025-11-17','2026-01-14',3,47541.35,4726.03,1136.00),(145,134,149,'2025-05-30','2025-06-28',3,171265.71,16887.51,6474.74),(146,110,110,'2025-08-21','2025-09-01',3,363577.23,12862.26,5559.55),(147,131,102,'2025-11-15','2025-12-02',2,114464.72,5693.38,1471.89),(148,149,135,'2025-04-01','2025-05-27',4,232934.83,13380.59,8082.93),(149,159,107,'2025-07-05','2025-09-01',2,346038.47,25047.60,15748.48),(150,105,155,'2025-03-27','2025-04-08',4,245953.65,12073.11,6224.35),(151,123,150,'2025-09-24','2025-10-20',3,85361.53,445.84,926.01),(152,157,125,'2025-02-06','2025-03-30',1,233398.02,807.16,431.59),(153,120,142,'2025-09-29','2025-10-19',2,154601.44,7525.46,4026.16),(154,113,113,'2025-08-24','2025-09-20',4,181111.03,1169.65,2542.11),(155,133,156,'2025-06-14','2025-07-02',3,349105.96,10587.72,4716.94),(156,129,104,'2025-12-12','2025-12-28',3,218529.96,12503.44,5845.47),(157,115,115,'2025-07-22','2025-08-31',3,461271.46,19606.44,947.02),(158,113,151,'2025-07-09','2025-08-28',3,180633.21,15085.46,1200.88),(159,151,107,'2025-08-22','2025-08-29',2,294026.51,6890.45,4636.95),(160,101,105,'2025-11-25','2025-12-18',4,46531.77,2145.79,1517.23);
/*!40000 ALTER TABLE `Order` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `OrderProduct`
--

DROP TABLE IF EXISTS `OrderProduct`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `OrderProduct` (
  `OrderID` int NOT NULL,
  `ProductID` int NOT NULL,
  `ProductCount` int NOT NULL,
  `ProductPrice` decimal(12,2) NOT NULL,
  PRIMARY KEY (`OrderID`,`ProductID`),
  KEY `fk_orderproduct_product_idx` (`ProductID`),
  KEY `fk_orderproduct_order_idx` (`OrderID`),
  CONSTRAINT `fk_orderproduct_order` FOREIGN KEY (`OrderID`) REFERENCES `Order` (`OrderID`),
  CONSTRAINT `fk_orderproduct_product` FOREIGN KEY (`ProductID`) REFERENCES `Product` (`ProductID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `OrderProduct`
--

LOCK TABLES `OrderProduct` WRITE;
/*!40000 ALTER TABLE `OrderProduct` DISABLE KEYS */;
INSERT INTO `OrderProduct` VALUES (1,1,1,18500.30),(1,2,1,60000.00),(2,5,1,13550.99),(3,7,1,7000.00),(3,8,1,77000.11),(3,9,1,30000.00),(4,7,1,7000.00),(4,11,1,17550.00),(5,3,1,44000.66),(6,1,1,18500.30),(6,2,1,60000.00),(6,3,1,44000.66),(101,121,1,44394.90),(101,140,1,51056.53),(102,132,1,71583.50),(103,127,1,141036.96),(104,110,1,36136.38),(104,129,1,79284.15),(105,132,1,93933.26),(106,108,1,12997.54),(107,123,1,49508.48),(107,137,1,53145.61),(108,107,1,10771.12),(108,129,1,62862.32),(108,158,1,103154.89),(108,159,1,106587.08),(109,136,1,115787.29),(109,150,1,56818.03),(110,131,1,136475.90),(110,140,1,130274.53),(111,103,1,128454.96),(111,118,1,141035.48),(111,133,1,46515.42),(111,157,1,57265.00),(112,102,1,136321.86),(112,119,1,18519.35),(113,111,1,89806.77),(114,102,1,90082.02),(114,106,1,41593.95),(114,152,1,73705.27),(115,109,1,117539.51),(115,114,1,33309.05),(115,116,1,91935.94),(115,144,1,54732.49),(116,107,1,81998.62),(116,130,1,27666.78),(116,148,1,14886.72),(117,110,1,130630.99),(117,123,1,84581.28),(118,104,1,64231.59),(118,121,1,34477.05),(119,103,1,114540.46),(119,141,1,42420.45),(119,144,1,98477.13),(120,150,1,83325.51),(121,132,1,43189.66),(121,137,1,120663.25),(121,152,1,104148.79),(122,135,1,136651.93),(123,119,1,102481.80),(123,126,1,15715.31),(123,128,1,130206.14),(123,130,1,26834.25),(124,151,1,115349.60),(125,115,1,81176.15),(125,137,1,38375.33),(125,157,1,99408.62),(126,111,1,16869.21),(126,119,1,71260.18),(126,127,1,77651.59),(126,148,1,17151.82),(127,101,1,108116.28),(127,110,1,118270.11),(127,127,1,22057.23),(127,141,1,104323.85),(128,114,1,31443.11),(128,116,1,30309.38),(128,129,1,127508.72),(128,138,1,44832.96),(129,102,1,148499.83),(129,105,1,41998.98),(129,146,1,33734.84),(129,155,1,15819.79),(130,112,1,80999.25),(130,129,1,130552.31),(130,135,1,82763.23),(131,109,1,11637.14),(131,142,1,113823.60),(131,154,1,66564.14),(131,156,1,60421.08),(132,122,1,26143.32),(132,133,1,53770.06),(132,144,1,7611.52),(132,149,1,119948.54),(133,112,1,85172.37),(133,147,1,135229.58),(133,155,1,66265.02),(134,140,1,93974.38),(135,106,1,125849.38),(135,150,1,122533.64),(135,154,1,125979.36),(135,158,1,33202.59),(136,141,1,128850.35),(136,160,1,142656.98),(137,116,1,75482.13),(137,153,1,105017.43),(138,124,1,98205.87),(138,137,1,89542.44),(139,148,1,17967.33),(140,102,1,12489.91),(140,112,1,53650.71),(141,107,1,44673.34),(141,116,1,67806.14),(141,121,1,121284.05),(142,101,1,49400.86),(142,114,1,15877.33),(142,127,1,98750.61),(142,142,1,105698.78),(143,135,1,138578.84),(144,116,1,132234.22),(145,119,1,69328.62),(146,136,1,29886.97),(146,153,1,124112.46),(147,125,1,76285.34),(147,149,1,60110.97),(147,154,1,135795.49),(148,111,1,104695.47),(148,120,1,55290.10),(148,148,1,7555.85),(148,150,1,64800.50),(149,109,1,62560.82),(149,146,1,102288.72),(150,104,1,31703.89),(150,121,1,66314.98),(150,126,1,74686.38),(151,117,1,131003.40),(151,159,1,19336.24),(152,148,1,108931.27),(152,152,1,137004.53),(153,103,1,100012.30),(153,107,1,65572.17),(153,128,1,29845.28),(153,156,1,88262.36),(154,131,1,96211.37),(154,141,1,10624.34),(154,146,1,62794.91),(154,148,1,18387.86),(155,124,1,122283.34),(155,137,1,53877.37),(156,106,1,18408.12),(156,118,1,108383.48),(156,144,1,136733.98),(156,151,1,56131.95),(157,120,1,27075.77),(157,121,1,140722.11),(157,135,1,5296.44),(157,155,1,109512.19),(158,130,1,143424.51),(158,153,1,90526.88),(158,159,1,109487.06),(159,104,1,84547.97),(159,111,1,105882.83),(160,113,1,108969.40),(160,119,1,16302.93),(160,129,1,89560.14);
/*!40000 ALTER TABLE `OrderProduct` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Product`
--

DROP TABLE IF EXISTS `Product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Product` (
  `ProductID` int NOT NULL AUTO_INCREMENT,
  `ProductName` varchar(75) NOT NULL,
  `ProductDescription` text NOT NULL,
  `ProductPhoto` text,
  `CategoryID` int NOT NULL,
  `BasePrice` decimal(9,2) NOT NULL,
  PRIMARY KEY (`ProductID`),
  KEY `fk_product_category_idx` (`CategoryID`),
  CONSTRAINT `fk_product_category` FOREIGN KEY (`CategoryID`) REFERENCES `Category` (`CategoryID`)
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Product`
--

LOCK TABLES `Product` WRITE;
/*!40000 ALTER TABLE `Product` DISABLE KEYS */;
INSERT INTO `Product` VALUES (1,'Digital Визитка Pro','Элегантная и современная одностраничная визитка вашей компании в цифровом пространстве. Включает профессиональное представление компании, детальное описание услуг и преимуществ, встроенную форму обратной связи, интерактивную карту расположения офиса, быстрые ссылки на все социальные сети и мессенджеры. Сайт оптимизирован для всех устройств и содержит счётчик посещений. Идеальное решение для стартапов, фрилансеров и малых предприятий, желающих произвести первое впечатление.','Сайт-визитка.png',1,18500.30),(2,'ShopMax – Премиум Магазин','Высокопроизводительный онлайн-магазин нового поколения с продвинутыми функциями электронной коммерции. Полноценный каталог товаров с неограниченным количеством позиций, многоуровневые фильтры по цене, характеристикам и отзывам, умная система рекомендаций похожих товаров. Интегрированы все популярные платёжные системы (Яндекс.Касса, Сбербанк, Paypal), система управления складом с отслеживанием остатков, личный кабинет клиента с историей заказов. Полная аналитика продаж в реальном времени и CRM для работы с клиентами.','Интернет-магазин.png',2,60000.00),(3,'CorporateHub Elite','Авторитетный корпоративный сайт, демонстрирующий профессионализм и масштаб вашей организации. Множество разделов: подробная история компании, полный каталог услуг и решений, команда сотрудников с фото и должностями, новостная лента с последними обновлениями, портфолио завершённых проектов, раздел с отзывами и кейсами клиентов. Встроена передовая CMS для управления контентом без технических знаний, интеграция с внутренними системами (1С, ERP), система документооборота. Мощная аналитика поведения посетителей.','Корпоративный сайт.png',3,44000.66),(4,'ConvertLand - Высокопродуктивный Лендинг','Специально разработанная целевая страница для максимального захвата внимания и преобразования посетителей в клиентов или лидов. Убедительный сценарий продаж с психологически проверенной структурой, минималистичный дизайн без отвлекающих элементов, привлекающие видеоролики и динамичные изображения. Оптимизированные формы заявок с минимальным количеством полей, счётчик отсчёта времени, социальное доказательство (отзывы, рейтинги). Полная интеграция с email-маркетингом и CRM-системами. Подробная аналитика конверсий каждого элемента.','Лендинг.png',4,10000.00),(5,'PortfolioShowcase Premium','Профессиональный сайт-портфолио для демонстрации вашего таланта и опыта. Красивая галерея работ с возможностью увеличения, фильтрации по категориям и датам выполнения. Детальные страницы для каждого проекта с описанием задачи, решения, использованных инструментов и результатов. Секция с информацией об авторе, квалификации, опыте и достижениях. Система отзывов от довольных клиентов с рейтингами и фотографиями. Встроённая форма для получения новых заказов и контактная информация.','Портфолио.png',5,13550.99),(6,'Интеллектуальный Блог','Мощная информационная платформа для публикации и распространения качественного контента. Интуитивная система создания статей с поддержкой богатого форматирования, встраивания видео и инфографики. Автоматическая категоризация и теги для удобной навигации, встроенный поиск по статьям с поддержкой фильтров. Система комментариев с модерацией и уведомлениями, возможность подписки читателей на обновления. Полная оптимизация для SEO, генерация RSS-ленты, интеграция с социальными сетями для автоматического шеринга.','Интелектуальный блог.png',6,11000.00),(7,'Личный Онлайн-Дневник','Уютное пространство для ведения личного дневника и творческого самовыражения в интернете. Приватные или полуоткрытые записи с контролем доступа, система закрепления важных заметок, галерея фото и видео к записям. Интерактивные элементы: опросы для читателей, стена комментариев, система лайков и рейтинга записей. Красивые темы оформления на выбор, возможность экспорта всех записей. Уведомления о новых комментариях и подписках. Полная конфиденциальность и безопасность данных.','Личный блог.png',6,7000.00),(8,'Портал Знаний','Масштабный информационный экосистем для размещения и организации большого объёма контента. Многоуровневая иерархия разделов и подразделов для логичной организации информации, динамическая система быстрого поиска по всему контенту, система рекомендений связанных материалов. Виджеты горячих новостей, рейтинга популярного контента и последних обновлений. Персонализация для каждого пользователя на основе его интересов, система уведомлений о новом контенте. Встроённая аналитика популярности материалов.','Информационный портал.png',7,77000.11),(9,'Динамичный Новостной Портал','Современная платформа для быстрого и эффективного распространения новостей и актуальной информации. Система горячих новостей с автоматическим выдвижением на первый план, категоризация новостей по темам с быстрым переходом между ними. Встроённая система лайков и комментариев для взаимодействия аудитории, возможность поделиться новостью в соцсетях одним кликом. Push-уведомления на мобильные устройства об важных новостях, RSS-лента для подписки. Полная оптимизация для поисковых систем и быстрой индексации.','Новостной сайт.png',8,30000.00),(10,'Cайт Форум','Живое интернет-сообщество для обсуждения интересующих вас тем и обмена ценным опытом. Удобная структура разделов и подразделов по различным категориям, древовидная структура тем и ответов для логичного диалога. Система репутации пользователей, значки и звания для активных участников, приватные сообщения между пользователями. Мощная модераторская панель для контроля качества контента, система автомодерации от спама и оскорблений. Интеграция с соцсетями для удобного входа, уведомления об ответах на ваши посты.','Форум.png',9,19080.99),(11,'Персональный Бренд','Веб-пространство для продвижения вашей личной марки и профессионального имиджа. Выразительная главная страница с кратким резюме и ключевыми компетенциями, детальный раздел опыта с описанием всех значимых проектов и достижений. Полный набор ваших навыков с визуализацией уровня владения, загружаемое резюме в PDF-формате. Портфолио завершённых проектов с описаниями и результатами, секция с благодарностями и рекомендациями от коллег. Встроённая контактная форма для приглашений на новые проекты и сотрудничество.','Персональный сайт.png',10,17550.00),(12,'Рекламная Платформа','Инновационный сайт для запуска и продвижения специальных рекламных кампаний и событий. Захватывающий дизайн с использованием современных визуальных эффектов, видеофон с автоматическим проигрыванием яркого видео. Интерактивные элементы: счётчик дней до события, таймер предложения, слайдеры с преимуществами. Встроённые формы регистрации и заказа предложения, интеграция с социальными сетями для массовой рассылки. Полная аналитика кликов, просмотров и конверсий кампании.','Промо-сайт.png',11,27700.00),(13,'Платформа Онлайн-Обучения','Профессиональная система управления обучением для создания и проведения онлайн-курсов. Структурированные курсы с модулями и уроками, видеолекции в высоком качестве с транскриптами, интерактивные задания и тесты для проверки знаний. Система отслеживания прогресса студентов с детальной статистикой, сертификаты об окончании курсов для резюме. Личные кабинеты студентов и преподавателей с удобным управлением, форум для обсуждения материалов курса. Встроённые платежи за курсы, аналитика популярности и эффективности контента.','Образовательный портал.png',12,80000.00),(101,'Маркетинг Хостинг 1','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',11,132483.67),(102,'Аудит Лендинг 2','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',11,102047.85),(103,'Оптимизация Дизайн 3','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',3,97334.42),(104,'Продвижение Копирайтинг 4','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',5,74712.85),(105,'Дизайн Маркетинг 5','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',11,7130.88),(106,'Маркетинг Продвижение 6','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',9,33859.77),(107,'Поддержка SEO 7','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',7,122518.43),(108,'SEO Лендинг 8','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',5,105755.56),(109,'Аудит Маркетинг 9','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',7,70874.77),(110,'Настройка Маркетинг 10','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',9,83584.06),(111,'Лендинг Маркетинг 11','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',9,53663.43),(112,'Лендинг Дизайн 12','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',3,106772.74),(113,'Дизайн SEO 13','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',7,29977.17),(114,'Хостинг SEO 14','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',4,27802.92),(115,'Настройка Аудит 15','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',3,44685.13),(116,'Оптимизация Продвижение 16','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',1,107155.96),(117,'Продвижение Продвижение 17','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',10,24421.11),(118,'Настройка SEO 18','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',11,98632.14),(119,'Лендинг Лендинг 19','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',5,80829.30),(120,'Аудит Копирайтинг 20','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',11,95045.61),(121,'Лендинг SEO 21','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',2,85688.55),(122,'Хостинг Маркетинг 22','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',2,57548.58),(123,'Поддержка Оптимизация 23','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',4,59717.59),(124,'Аудит Настройка 24','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',1,61224.71),(125,'Настройка Копирайтинг 25','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',9,31349.08),(126,'Дизайн Лендинг 26','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',8,113337.00),(127,'Хостинг Хостинг 27','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',2,59388.48),(128,'Поддержка Дизайн 28','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',8,122411.61),(129,'Разработка SEO 29','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',2,127444.60),(130,'Настройка Оптимизация 30','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',1,91273.74),(131,'Настройка Хостинг 31','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',12,143458.13),(132,'Разработка Хостинг 32','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',12,29157.21),(133,'Настройка Разработка 33','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',7,110858.73),(134,'Продвижение Поддержка 34','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',9,62454.28),(135,'Лендинг Оптимизация 35','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',10,126724.49),(136,'Маркетинг Лендинг 36','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',4,87107.16),(137,'SEO Маркетинг 37','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',5,97334.68),(138,'Поддержка Разработка 38','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',10,22974.95),(139,'Аудит Копирайтинг 39','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',9,5173.36),(140,'Хостинг Хостинг 40','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',4,137726.13),(141,'SEO Настройка 41','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',1,140715.45),(142,'Настройка Аудит 42','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',1,91973.89),(143,'Разработка Хостинг 43','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',7,126114.84),(144,'Копирайтинг Маркетинг 44','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',8,42748.47),(145,'Маркетинг Лендинг 45','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',10,47272.45),(146,'Дизайн Поддержка 46','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',5,13175.87),(147,'Оптимизация Дизайн 47','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',3,33760.44),(148,'Поддержка Разработка 48','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',6,83071.47),(149,'Продвижение SEO 49','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',12,55639.85),(150,'Продвижение Оптимизация 50','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',11,26297.84),(151,'Продвижение Лендинг 51','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',12,5693.11),(152,'Аудит Продвижение 52','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',2,29309.03),(153,'Поддержка Хостинг 53','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',12,134292.90),(154,'Разработка Оптимизация 54','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',3,60679.54),(155,'Аудит Лендинг 55','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',2,118866.84),(156,'Аудит Хостинг 56','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',4,19692.15),(157,'Аудит Аудит 57','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',8,138735.93),(158,'Копирайтинг Продвижение 58','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',8,50751.23),(159,'SEO Дизайн 59','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',12,22131.35),(160,'Оптимизация Лендинг 60','Тестовое описание услуги или товара. Включает базовые функции и настройки.','default.png',5,85416.27);
/*!40000 ALTER TABLE `Product` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Role`
--

DROP TABLE IF EXISTS `Role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Role` (
  `RoleID` int NOT NULL AUTO_INCREMENT,
  `RoleName` varchar(30) NOT NULL,
  PRIMARY KEY (`RoleID`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Role`
--

LOCK TABLES `Role` WRITE;
/*!40000 ALTER TABLE `Role` DISABLE KEYS */;
INSERT INTO `Role` VALUES (1,'Администратор'),(2,'Менеджер'),(3,'Директор');
/*!40000 ALTER TABLE `Role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Status`
--

DROP TABLE IF EXISTS `Status`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Status` (
  `StatusID` int NOT NULL AUTO_INCREMENT,
  `StatusName` varchar(30) NOT NULL,
  PRIMARY KEY (`StatusID`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Status`
--

LOCK TABLES `Status` WRITE;
/*!40000 ALTER TABLE `Status` DISABLE KEYS */;
INSERT INTO `Status` VALUES (1,'Новый'),(2,'В работе'),(3,'Завершён'),(4,'Отменён');
/*!40000 ALTER TABLE `Status` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Users`
--

DROP TABLE IF EXISTS `Users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Users` (
  `UserID` int NOT NULL AUTO_INCREMENT,
  `Surname` varchar(90) NOT NULL,
  `FirstName` varchar(75) NOT NULL,
  `MiddleName` varchar(90) DEFAULT NULL,
  `UserLogin` varchar(20) NOT NULL,
  `UserPassword` varchar(255) NOT NULL,
  `RoleID` int NOT NULL,
  `PhoneNumber` varchar(20) NOT NULL,
  PRIMARY KEY (`UserID`),
  UNIQUE KEY `UserLogin_UNIQUE` (`UserLogin`),
  UNIQUE KEY `UserPassword_UNIQUE` (`UserPassword`),
  KEY `fk_user_role_idx` (`RoleID`),
  CONSTRAINT `fk_user_role` FOREIGN KEY (`RoleID`) REFERENCES `Role` (`RoleID`)
) ENGINE=InnoDB AUTO_INCREMENT=161 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Users`
--

LOCK TABLES `Users` WRITE;
/*!40000 ALTER TABLE `Users` DISABLE KEYS */;
INSERT INTO `Users` VALUES (1,'Солоников','Антон','Сергеевич','1','6b86b273ff34fce19d6b804eff5a3f5747ada4eaa22f1d49c01e52ddb7875b4b',1,'+7 (986) 769-19-66'),(2,'Муравьев','Максим','Алексеевич','2','d4735e3a265e16eee03f59718b9b5d03019c07d8b6c51f90da3a666eec13ab35',2,'+7 (930) 751-12-12'),(3,'Сидоркин','Даниил','Дмитриевич','Sidorkin1','8c6976e5b5410415bde908bd4dee15dfb167a9c873fc4bb8a81f6f2ab448a918',1,'+7 (930) 112-12-65'),(5,'Беляева','Кристина','Олеговна','3','4e07408562bedb8b60ce05c1decfe3ad16b72230967de01f640b7e4729b49fce',3,'+7 (980) 222-21-31'),(6,'Иванов','Иван','Иванович','loginBDgfd2025','fdbabf061aadd0bc7f2eb9bb6c6588cb132addd6e97e046b8ccde7df51f923a3',2,'+7 (930) 451-55-51'),(13,'Беляев','Андрей','Андреевич','loginBDpga2025','6dfed725e346893774e1517b779e98e6bab42452bc09fe0a4cf8b2a7631645ca',2,'+7 (211) 769-11-12'),(19,'Ширяева','Валерия','Павловна','loginBDzzz2025','2d0a3d55e369ba93b5e21787ea0a1eb16430c2047298cb4dccc204a3a2ff2509',1,'+7 (930) 739-19-21'),(28,'Егорова','Виктория','Дмитриевна','loginBDpps2025','837415d9be86d98841e560e604a231c730ffe0913eca63676e6eb9a35f998530',2,'+7 (901) 722-19-22'),(31,'Шиханова','Дарья','Сергеевна','loginBDoiu2025','b390e506a89e4be4ea1be6ffd58e9d1dcbdd6d9fce55c368f4681c4de42662da',1,'+7 (333) 702-19-11'),(35,'Мартынова','Екатерина','Олеговна','loginEO2025','236ce6028a39cbca9311b198d004ac06d2f0e141cf8915ec012c129ab73828fb',2,'+7 (901) 100-22-35'),(38,'Егорова','Дарья','Павловна','loginDP2025','01bff976f3351845be753a796da87e0776b1409ec402090315e09290e0ad1aaf',3,'+7 (901) 100-22-38'),(40,'Богданова','Ирина','Александровна','loginIA2025','075e5ccfe524c85ec85bd50225f238c5b337d11b67753998abc3b41b62d691ec',3,'+7 (901) 100-22-40'),(101,'Попов','Егор','Дмитриевич','user_1_uf7l','5494368a97a134cc1816418b68c11e11daae22b327190cb9425aaa53555bd810',2,'+7 (999) 625-58-19'),(102,'Николаев','Илья','Евгеньевич','user_2_2q8y','390d10a858fba7c6971d89539a129cbd75febcfef3f91cc3af99b049d7b552ac',2,'+7 (999) 731-94-23'),(103,'Иванов','Антон','Максимович','user_3_huaj','22458973221f969198904e9d9638ac3d6309823d2af824637b2775b1b2b4afbc',2,'+7 (999) 609-42-41'),(104,'Петров','Илья','Евгеньевич','user_4_jqwc','66b9dc8e0202d546b44dc5501c1be4a1dfb456be13e58afd57006cfa4387caa6',3,'+7 (999) 658-15-53'),(105,'Семёнов','Сергей','Николаевич','user_5_prjk','4bd917bc8442a0ddade184981c3956dff22085836e46287e326a23e181d804bd',2,'+7 (999) 432-35-78'),(106,'Лебедев','Егор','Александрович','user_6_okjn','e2236d4ae27bed3ccd0e1b6254a32a0ce41a84ea5181a725823b78028bac25bc',3,'+7 (999) 177-42-39'),(107,'Козлов','Дмитрий','Николаевич','user_7_i53k','4bf9635bfcf6d3e734ae0e28f289c953a04ac6c8ce0394c45b57f402756dcb34',2,'+7 (999) 311-18-41'),(108,'Петров','Павел','Дмитриевич','user_8_06lg','dc508235d25ea632181326155099c2c1fe26a81eb08be718e8674eeef84a667f',1,'+7 (999) 711-99-35'),(109,'Козлов','Денис','Максимович','user_9_vzc8','14dab045fd53b35d07e3f27dd7697c4078e731e5e8fa35ddaadb1a62b65b3d45',2,'+7 (999) 721-24-29'),(110,'Фёдоров','Сергей','Александрович','user_10_5fck','fa68adb061ff83d2a14ffb4791bfd4287a73a359d0ffe418c65fe25e04a2633a',3,'+7 (999) 272-25-31'),(111,'Попов','Денис','Алексеевич','user_11_xo4o','dc3e98f620f003264041866cf681845590384becce0ceb318ae652076a1aec4b',1,'+7 (999) 283-84-38'),(112,'Морозов','Дмитрий','Дмитриевич','user_12_729h','26821ebe9c4dfe09bce83f10b03541addae4a5136593296efad74b065372aed9',1,'+7 (999) 428-12-92'),(113,'Козлов','Евгений','Иванович','user_13_mmrd','e7657378020b58e774d200b92d1b28a7dfdcb85c04dc86c91c5ef7262dbbcfa0',2,'+7 (999) 957-69-93'),(114,'Лебедев','Константин','Юрьевич','user_14_1vg5','53f9b11b7a156e310a14af9f21e4e46e55d618232490e08eb9de6521fd730d71',1,'+7 (999) 442-75-22'),(115,'Соколов','Антон','Николаевич','user_15_1gtt','8a5ef8a84610af325fa3688db52538c317acbff35797e3e0193bbd0caef47640',3,'+7 (999) 569-90-13'),(116,'Морозов','Антон','Алексеевич','user_16_nonw','6701c1c9e56812062b71cf47a063badfb5cc6f76ac084946dbf8d735b16a601a',2,'+7 (999) 627-83-72'),(117,'Степанов','Егор','Владимирович','user_17_olfy','e1a40730c91499afa8ef849fdbfc05898de53afefa564a752ad588d4d6a7cda2',2,'+7 (999) 886-40-92'),(118,'Семёнов','Роман','Петрович','user_18_4hed','924a14b05c24d956f56637ba65181a3829a61ef840437c5756c169b15e12e854',2,'+7 (999) 275-49-50'),(119,'Попов','Дмитрий','Петрович','user_19_ysn7','155f810be8bd83ebd08b46570f713be891293ae5e3cd9cbc8ceb0e5f721b53fd',3,'+7 (999) 651-18-99'),(120,'Козлов','Роман','Юрьевич','user_20_b9sw','cb13a90f2bf20fad27b6aef3101384fb0146255de32ef374ecbeba228e0d0135',3,'+7 (999) 378-71-12'),(121,'Петров','Александр','Николаевич','user_21_4fv1','db0d23bf4e99bf8c1e1be06a0819fae70f42bf5acf0a0e80721b2d9078a312b7',2,'+7 (999) 738-63-69'),(122,'Петров','Роман','Евгеньевич','user_22_t6i3','c096ce1152a17beeabb15ea5bd5652380e9ff199c60647a81f58699ef108820c',2,'+7 (999) 696-24-78'),(123,'Соколов','Павел','Алексеевич','user_23_scf3','1b13c0ef3cc173b3603caa906a3b098463a0af0171ef9355002bc322cdce3d04',2,'+7 (999) 242-36-50'),(124,'Павлов','Егор','Андреевич','user_24_3w4g','70afbaab7f79e072990d53e3074fce9d94edd79a4296bdc1d7985ffaac7bcb96',1,'+7 (999) 781-45-90'),(125,'Егоров','Егор','Иванович','user_25_2v4g','9d4ec98c41af33a7467ab3a918579dc38fa4adc9a2246779da5c59f51dc8380a',1,'+7 (999) 704-27-32'),(126,'Михайлов','Даниил','Олегович','user_26_quh3','bb0d49952701a3347a4228c120f8eb608a7d5f35ed639cefa0ee4f7de70ef26a',3,'+7 (999) 696-68-59'),(127,'Волков','Александр','Петрович','user_27_qp3p','ce8732557b62773fa6d989b4d2ac2a81ac97933aadf5b834dd0a917780dfa6b8',1,'+7 (999) 460-72-24'),(128,'Михайлов','Михаил','Сергеевич','user_28_d9xg','167dc140dc2ebbb2f4eec1cfc0e3da3721dad3ee0e3e33ceb595c1c31219892e',3,'+7 (999) 758-79-80'),(129,'Фёдоров','Евгений','Олегович','user_29_eqwk','2f173c24535a4f06378d2a0ff0e9a87efa0ca2efd7e681e91b065a8ea86d122d',2,'+7 (999) 158-40-78'),(130,'Семёнов','Сергей','Александрович','user_30_vbyj','4ba94636241500a9bd0634c65de9aae0602763616e87410fc83de10fe58704c2',1,'+7 (999) 320-15-38'),(131,'Фёдоров','Иван','Петрович','user_31_7b62','5b8000e7571954087fc3ac5df8f3be38a30a6fa150a020ace83fb77a3c1e2183',3,'+7 (999) 299-65-53'),(132,'Петров','Андрей','Николаевич','user_32_u6er','88f133055700d98dbb870ab62612c0cb5140338ca41fc559a4d277d8afa28ed9',1,'+7 (999) 319-18-32'),(133,'Попов','Владислав','Михайлович','user_33_p9un','24fdcc63a8b1d83bf4be8444c6325122504d1409a885946a876f8475d141fc30',3,'+7 (999) 103-20-22'),(134,'Егоров','Артём','Анатольевич','user_34_9tux','03a566a520d323079c30a050daed075418c0bfaed9467b26a2bde440beb7542e',2,'+7 (999) 184-26-56'),(135,'Егоров','Иван','Дмитриевич','user_35_x537','fd85246b20e122832bc146995ac758af3a32f7c29fc3ddef9af96c377e151318',2,'+7 (999) 197-61-48'),(136,'Волков','Артём','Анатольевич','user_36_prfc','4f278dc5caaa8bfa93bb9151973642d39ab1869817112e9f5f74d61225c7d819',1,'+7 (999) 715-15-33'),(137,'Козлов','Михаил','Максимович','user_37_atc2','7229b105c7113715c46f5d84860072e1c12c9ddc611a76fb8bc545a9070634cb',3,'+7 (999) 386-59-69'),(138,'Попов','Никита','Анатольевич','user_38_yfzi','0104b9de0ebdddf56d5842c824ab0f087dbf00e07672c222df18603cf8acc9da',2,'+7 (999) 630-99-58'),(139,'Васильев','Антон','Максимович','user_39_f53p','79ecb68fa73145cb531b518078b92bef57f9308bee9d49689ace7b9f8caccdff',3,'+7 (999) 325-89-96'),(140,'Соколов','Алексей','Анатольевич','user_40_zw1g','2531e2262f62678027123a392481b10f32214accd37dcaeebc4cd4ccc385aba6',3,'+7 (999) 348-27-63'),(141,'Иванов','Павел','Михайлович','user_41_xh4d','35920671eaeea16f7a659df8fc5b4885233b6c699af59933e20cb1e76f43d1f2',2,'+7 (999) 427-78-75'),(142,'Кузнецов','Даниил','Николаевич','user_42_9v9x','54457c6e195792875f494d2adfc8d78a2dbbc7dd441c0fca0307a8e4fba742bb',1,'+7 (999) 299-56-71'),(143,'Иванов','Дмитрий','Петрович','user_43_ky5z','607482a203f93f5da868f1a68a53e0a592a414fc13f22e8ce40da9f1c60e3eb3',1,'+7 (999) 941-40-19'),(144,'Николаев','Антон','Юрьевич','user_44_xja1','3b25991ac17450ef9ced52e185796fe85e8a88afc43fa388b2a4431bc09920fe',3,'+7 (999) 617-59-54'),(145,'Соколов','Михаил','Алексеевич','user_45_c8xb','1b9b06b69ec605801bd236595aecc04a8c740eccc82f0da444e42cba1d2742ec',2,'+7 (999) 208-52-40'),(146,'Новиков','Даниил','Николаевич','user_46_giu8','4dfd5c67eedd9832680070913bd9f23a81a0cd377ca5ae4e3baf06ea980a7d5f',2,'+7 (999) 451-67-29'),(147,'Степанов','Сергей','Дмитриевич','user_47_9639','86f7c71f36255b8376bb13983f0c9db13e57ccfc0948bcd466431d0037d5084e',1,'+7 (999) 837-70-11'),(148,'Васильев','Дмитрий','Олегович','user_48_wyij','2f843ebec40822427425d300bd5e0843c5c5e53f66b0179df7a64452b2420cfe',1,'+7 (999) 347-98-13'),(149,'Кузнецов','Иван','Николаевич','user_49_bn8x','2aab4b25e33c8ad6c29949316a30ee2bd45c222516214db8f6f5849a3fcbe238',1,'+7 (999) 562-34-50'),(150,'Попов','Иван','Андреевич','user_50_ju07','6b24cc35a7eeea0287e65d7851e33e5c6b1539d4f7dd90fcdcc3fa3874715374',3,'+7 (999) 223-35-55'),(151,'Иванов','Денис','Юрьевич','user_51_1wnk','f76914dafa31586b9a7f500523070216650f2dc87af1629634d8c17ec27b7f73',3,'+7 (999) 266-84-57'),(152,'Николаев','Егор','Николаевич','user_52_aree','eb8bb8e6b73a0c7aea3ff50b36a4a84cacbd197396a39e22ce9ab1b0886cd981',2,'+7 (999) 257-64-68'),(153,'Соколов','Алексей','Максимович','user_53_pk4q','0597e222aabc1f90a9313263347c66d7c86a084acea852c6ea913dc3b2739776',1,'+7 (999) 991-52-83'),(154,'Лебедев','Дмитрий','Иванович','user_54_t2hm','c8123db75dde414bf5abece31ed499adf27dd966c384e50016e6dda2c6d4c0aa',1,'+7 (999) 248-39-25'),(155,'Петров','Антон','Максимович','user_55_27yf','674ab32006b13f25e24683719e3109dd2796f871b20e9f4c8b4d69dc46d8450c',2,'+7 (999) 316-19-98'),(156,'Васильев','Артём','Иванович','user_56_wyir','f000bb8ff5debdc648bd949125164d9e7ae4568bb5e781ce13d01b8efd19ffe5',3,'+7 (999) 578-61-85'),(157,'Степанов','Андрей','Сергеевич','user_57_5zud','ce6e62c86cde3fba69ab906e672ed36906070bfd8e12d6a21ae24cd8a177f608',3,'+7 (999) 171-96-12'),(158,'Алексеев','Никита','Евгеньевич','user_58_ftv0','580159975e174d3cb2e4668f986b165755d5320535efe0b12b04012922caf14a',2,'+7 (999) 945-79-81'),(159,'Соколов','Алексей','Михайлович','user_59_qc75','187cac9e0c771b8f4b05fdf39719a264d41a6b0bf478917cc386ac1cad402584',3,'+7 (999) 464-59-69'),(160,'Волков','Денис','Олегович','user_60_c5xy','4d68551d7dc19be01e42aa8ef9a30de5124c112830c5bfe82d3dbc0ba8bf56f4',3,'+7 (999) 906-25-80');
/*!40000 ALTER TABLE `Users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'dbwebshop'
--

--
-- Dumping routines for database 'dbwebshop'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-09 13:44:51
